# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растет на круглой грядке, причем кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на 
# них выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать 
# за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.


b = int (input("Введите количество кустов: "))


def randonLen(n):
    array = list()
    from random import randint 
    for _ in range(n):
        array.append(randint(0, 10))
    return array

ar = randonLen(b)
print(ar)



resultList= list()
for i in range(1, len(ar)-1):
    resultList.append(ar[i]+ar[i-1]+ar[i+1])



result= max(resultList)
 
print(result)